Terraform plan for __dev__
<details>
  <summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.istio_telemetry_proxy[0].helm_release.istio_telemetry_proxy will be created
  + resource "helm_release" "istio_telemetry_proxy" {
      + atomic                     = false
      + chart                      = "/github/home/.dflook-terraform-data-dir/modules/istio_telemetry_proxy/addons/istio-telemetry-proxy/chart"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-telemetry-proxy"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                gateways:
                  - core-gateway.default.svc.cluster.local
                
                ingress:
                  uriPrefix: /prometheus
                  hosts:
                    - "*"
                
                prometheus:
                  secretName: prometheus-proxy-auth
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "istio_flag"
          + value = "false"
        }
      + set {
          + name  = "prometheus.secretName"
          + value = "prometheus-proxy-auth"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on istio_telemetry_gke.tf line 26, in module "istio_telemetry_proxy":
  26:     kubernetes = kubernetes.gke

Module module.istio_telemetry_proxy does not declare a provider named
kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.

(and one more similar warning elsewhere)
```
</details>

Plan generated in [Terraform #206](https://github.com/ebomart/commerce-infrastructure/actions/runs/1290595647)